In [1]:
import pandas as pd
import numpy as np
import pymysql as mysql
from sqlalchemy import create_engine

In [2]:
requiredFields = ['device','company','cpuName','cores','clock','cpuScore','Total Score']

In [3]:
# Reading data set to start with data wrangling
smartphones_dataset = pd.read_csv('./DS_Smartphones.csv', usecols=requiredFields)

In [4]:
smartphones_dataset

,device,company,cpuName,cores,clock,cpuScore,Total Score
0,iPhone 13 Pro Max,Apple,A15 Bionic,6,3230,935,1429728
1,iPhone 13 Pro,Apple,A15 Bionic,6,3230,931,1360219
2,iPhone 13 mini,Apple,A15 Bionic,6,3230,924,1228385
3,iPad Pro (12.9-inch 5th generation),Apple,M1,8,3190,1013,1038771
4,iPad Pro (11-inch 3rd generation),Apple,M1,8,3190,1011,986840
...,...,...,...,...,...,...,...
183,Samsung Galaxy Note FE,Samsung,Exynos 8890,8,1300,133,341482
184,Huawei Nexus 6P,Qualcomm,Snapdragon 810,8,1555,85,340155
185,LG Nexus 5X,Qualcomm,Snapdragon 808,6,1440,78,330916
186,LG V30,Qualcomm,Snapdragon 835,8,1900,146,329717
187,Samsung Galaxy A21s,Samsung,Exynos 850,8,2002,96,323765

In [5]:
dim_device = pd.DataFrame({
  'device_name': smartphones_dataset['device'].drop_duplicates().reset_index(drop=True)})
dim_device.insert(0, 'id_device', range(1, len(dim_device) + 1))

In [6]:
dim_device

     id_device                          device_name
0            1                    iPhone 13 Pro Max
1            2                        iPhone 13 Pro
2            3                       iPhone 13 mini
3            4  iPad Pro (12.9-inch 5th generation)
4            5    iPad Pro (11-inch 3rd generation)
..         ...                                  ...
182        183               Samsung Galaxy Note FE
183        184                      Huawei Nexus 6P
184        185                          LG Nexus 5X
185        186                               LG V30
186        187                  Samsung Galaxy A21s

[187 rows x 2 columns]

In [7]:
dim_company = pd.DataFrame({
  'company_name': smartphones_dataset['company'].drop_duplicates().reset_index(drop=True)})
dim_company.insert(0, 'id_company', range(1, len(dim_company) + 1))

In [8]:
dim_company

   id_company company_name
0           1        Apple
1           2       Google
2           3     Qualcomm
3           4     MediaTek
4           5      Samsung
5           6    HiSilicon
6           7       NVIDIA

In [9]:
dim_cpus = pd.DataFrame({
  'cpu_name': smartphones_dataset['cpuName'].drop_duplicates().reset_index(drop=True),
  'cores': smartphones_dataset['cores'].drop_duplicates().reset_index(drop=True),
  'clock': smartphones_dataset['clock'].drop_duplicates().reset_index(drop=True),
  'score': smartphones_dataset['cpuScore'].drop_duplicates().reset_index(drop=True)})
dim_cpus.insert(0, 'id_cpu', range(1, len(dim_cpus) + 1))

In [10]:
dim_cpus

     id_cpu       cpu_name  cores   clock  score
0         1  A15 Bionic       6.0  3230.0    935
1         2         M1        8.0  3190.0    931
2         3  A14 Bionic       4.0  2920.0    924
3         4     Tensor        2.0  2990.0   1013
4         5  A13 Bionic       3.0  1803.0   1011
..      ...            ...    ...     ...    ...
145     146            NaN    NaN     NaN     89
146     147            NaN    NaN     NaN    133
147     148            NaN    NaN     NaN     85
148     149            NaN    NaN     NaN     78
149     150            NaN    NaN     NaN     96

[150 rows x 5 columns]

In [11]:
fact_smartphones = smartphones_dataset
fact_smartphones = pd.merge(dim_device, fact_smartphones, how='inner', left_on='device_name', right_on='device').drop(['device_name', 'device'], axis = 1)
fact_smartphones = pd.merge(dim_company, fact_smartphones, how='inner', left_on='company_name', right_on='company').drop(['company_name', 'company'], axis = 1)
fact_smartphones = pd.merge(dim_cpus, fact_smartphones, how='inner', left_on='cpu_name', right_on='cpuName').drop(['cpu_name', 'cpuName', 'cores_x', 'clock_x', 'cores_y', 'clock_y', 'score', 'cpuScore'], axis = 1)
fact_smartphones

     id_cpu  id_company  id_device  Total Score
0         1           1          1      1429728
1         1           1          2      1360219
2         1           1          3      1228385
3         1           1          6       982228
4         1           1          7       977395
..      ...         ...        ...          ...
183      59           5        182       342845
184      60           5        183       341482
185      61           3        184       340155
186      62           3        185       330916
187      63           5        187       323765

[188 rows x 4 columns]

In [12]:
try: connection = mysql.connect(host='db-udlsb.cdzdfws2acz2.us-east-1.rds.amazonaws.com', user='adminSalle', password='Walito17$'); print ('Succesfully connected to MariaDB Server')
except: print ('Cannot connect to MariaDB Server')

Succesfully connected to MariaDB Server

In [13]:
# Creates new cursor from MariaDB connection
cur = connection.cursor()
# Drops database to fill new data
try:
  cur.execute("DROP DATABASE IF EXISTS dm_smartphones")
  cur.execute("CREATE DATABASE dm_smartphones")
  connection.commit()
except:
  print ("Query Error")
cur.close()

In [14]:
# Creates engine for database "dm_datamart"
engine = create_engine('mysql+pymysql://adminSalle:Walito17$@db-udlsb.cdzdfws2acz2.us-east-1.rds.amazonaws.com/dm_smartphones')

In [15]:
dim_device.to_sql('dim_device', engine, if_exists='replace', index=False)
dim_company.to_sql('dim_company', engine, if_exists='replace', index=False)
dim_cpus.to_sql('dim_cpus', engine, if_exists='replace', index=False)
fact_smartphones.to_sql('fact_smartphones', engine, if_exists='replace', index=False)